CSI API ETABS v1
cSelect.All Method
 Selects or deselects all objects in the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int All(
	bool Deselect = false
)
Function All (
	Optional Deselect As Boolean = false
) As Integer
Dim instance As cSelect
Dim Deselect As Boolean
Dim returnValue As Integer
returnValue = instance.All(Deselect)
int All(
	bool Deselect = false
)
abstract All :
        ?Deselect : bool
(* Defaults:
        let _Deselect = defaultArg Deselect false
*)
-> int
Parameters
Deselect (Optional)
Type: System.Boolean
 The item is False if objects are to be selected and True if they are to be deselected.
Return Value
Type: Int32
 Returns zero if the selection is successfully completed, otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'select all
       ret = SapModel.SelectObj.All()
   'deselect all
       ret = SapModel.SelectObj.All(True)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSelect Interface
ETABSv1 Namespace